{
  "@context": "https://schema.org",
  "@type": "SoftwareApplication",
  "name": "Bank Statement Pro",
  "operatingSystem": "macOS",
  "applicationCategory": "FinanceApplication",
  "offers": {
    "@type": "Offer",
    "price": "0",
    "priceCurrency": "USD",
    "description": "Free download with 3 free AI generations. Premium unlimited processing for $20/month."
  },
  "description": "AI-powered bank statement converter for Mac. Free download with 3 free AI generations for testing. Convert bank statements to Excel, CSV, and more with privacy protection.",
  "url": "https://bankstatementpro.app",
  "screenshot": "https://res.cloudinary.com/drveridbx/image/upload/v1760684352/Bank_Statement_Pro_OG_Image_New_lwkwj8.png"
}

{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "How does privacy protection work?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Bank Statement Pro automatically redacts all personal information (account numbers, names, addresses) before sending transaction data for AI processing. Your sensitive information stays private, and only anonymized transaction data is processed to categorize and organize your financial records."
      }
    },
    {
      "@type": "Question",
      "name": "How accurate is the AI categorization?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Our AI achieves 99.9% accuracy in transaction categorization through advanced machine learning models trained on millions of financial transactions. The system recognizes merchant patterns, transaction types, and spending categories with industry-leading precision."
      }
    },
    {
      "@type": "Question",
      "name": "What file formats are supported?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Bank Statement Pro supports importing PDF bank statements, CSV files, and image formats (JPEG, PNG). You can export your processed data in Excel (.xlsx), CSV, PDF, JSON, and QIF formats for seamless integration with popular accounting software like QuickBooks, Xero, and FreshBooks."
      }
    },
    {
      "@type": "Question",
      "name": "What are the system requirements?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Bank Statement Pro requires macOS 12.0 or later and works on both Intel and Apple Silicon Macs. The app requires approximately 2GB of free disk space for AI models and processed data storage. No internet connection is required for processing your documents."
      }
    },
    {
      "@type": "Question",
      "name": "How does the free download work?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Bank Statement Pro is free to download from the Mac App Store and includes 3 free AI generations so you can test the app's capabilities. After your free generations are used, you can subscribe to AI Premium for unlimited processing. The premium subscription includes a 7-day free trial."
      }
    }
  ]
}
