{
  "@context": "https://schema.org",
  "@type": "SoftwareApplication",
  "name": "Bank Statement Pro",
  "operatingSystem": "macOS",
  "applicationCategory": "FinanceApplication",
  "offers": {
    "@type": "Offer",
    "price": "0",
    "priceCurrency": "USD",
    "description": "Free tier available. Premium AI features for $20/month."
  },
  "description": "AI-powered bank statement converter for Mac. Convert bank statements to Excel, CSV, and more with privacy-first local processing.",
  "url": "https://bankstatementpro.app",
  "screenshot": "https://res.cloudinary.com/drveridbx/image/upload/v1760684352/Bank_Statement_Pro_OG_Image_New_lwkwj8.png"
}

{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "How does local processing protect my privacy?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Bank Statement Pro processes all your financial data locally on your Mac using advanced AI models. Your sensitive information never leaves your device, and there are no cloud servers involved. This ensures complete privacy protection and compliance with financial data regulations."
      }
    },
    {
      "@type": "Question",
      "name": "How accurate is the AI categorization?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Our AI achieves 99.9% accuracy in transaction categorization through advanced machine learning models trained on millions of financial transactions. The system recognizes merchant patterns, transaction types, and spending categories with industry-leading precision."
      }
    },
    {
      "@type": "Question",
      "name": "What file formats are supported?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Bank Statement Pro supports importing PDF bank statements, CSV files, and image formats (JPEG, PNG). You can export your processed data in Excel (.xlsx), CSV, PDF, JSON, and QIF formats for seamless integration with popular accounting software like QuickBooks, Xero, and FreshBooks."
      }
    },
    {
      "@type": "Question",
      "name": "What are the system requirements?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Bank Statement Pro requires macOS 12.0 or later and works on both Intel and Apple Silicon Macs. The app requires approximately 2GB of free disk space for AI models and processed data storage. No internet connection is required for processing your documents."
      }
    },
    {
      "@type": "Question",
      "name": "How does the free trial work?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The free tier includes basic document processing and export capabilities. You can upgrade to AI Premium at any time to unlock advanced AI features, real-time processing, and batch capabilities. The premium trial includes a 7-day free trial with full access to all AI-powered features."
      }
    }
  ]
}
